Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
time_distributed_22 (TimeDis (None, 6, 32, 32, 32)     896       
_________________________________________________________________
time_distributed_23 (TimeDis (None, 6, 32, 32, 32)     9248      
_________________________________________________________________
time_distributed_24 (TimeDis (None, 6, 32, 32, 32)     9248      
_________________________________________________________________
time_distributed_25 (TimeDis (None, 6, 16, 16, 32)     9248      
_________________________________________________________________
time_distributed_26 (TimeDis (None, 6, 8, 8, 32)       0         
_________________________________________________________________
time_distributed_27 (TimeDis (None, 6, 8, 8, 64)       18496     
_________________________________________________________________
time_distributed_28 (TimeDis (None, 6, 8, 8, 64)       36928     
_________________________________________________________________
time_distributed_29 (TimeDis (None, 6, 4, 4, 64)       0         
_________________________________________________________________
time_distributed_30 (TimeDis (None, 6, 4, 4, 128)      73856     
_________________________________________________________________
time_distributed_31 (TimeDis (None, 6, 2, 2, 128)      0         
_________________________________________________________________
time_distributed_32 (TimeDis (None, 6, 512)            0         
_________________________________________________________________
lstm_2 (LSTM)                (None, 128)               328192    
_________________________________________________________________
dropout_4 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 256)               33024     
_________________________________________________________________
dropout_5 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 4)                 1028      
=================================================================
Total params: 520,164
Trainable params: 520,164
Non-trainable params: 0
_________________________________________________________________
