Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_24 (Conv2D)           (None, 32, 32, 16)        448       
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 16, 16, 16)        2320      
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 8, 8, 16)          0         
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 8, 8, 32)          4640      
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 8, 8, 32)          9248      
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 512)               0         
_________________________________________________________________
dropout_12 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_12 (Dense)             (None, 256)               131328    
_________________________________________________________________
dropout_13 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_13 (Dense)             (None, 4)                 1028      
=================================================================
Total params: 149,012
Trainable params: 149,012
Non-trainable params: 0
_________________________________________________________________
