Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
time_distributed_20 (TimeDis (None, 6, 32, 32, 32)     896       
_________________________________________________________________
time_distributed_21 (TimeDis (None, 6, 16, 16, 32)     9248      
_________________________________________________________________
time_distributed_22 (TimeDis (None, 6, 8, 8, 32)       0         
_________________________________________________________________
time_distributed_23 (TimeDis (None, 6, 2048)           0         
_________________________________________________________________
lstm_5 (LSTM)                (None, 128)               1114624   
_________________________________________________________________
dropout_10 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 256)               33024     
_________________________________________________________________
dropout_11 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 4)                 1028      
=================================================================
Total params: 1,158,820
Trainable params: 1,158,820
Non-trainable params: 0
_________________________________________________________________
