Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_56 (Conv2D)           (None, 32, 32, 16)        448       
_________________________________________________________________
conv2d_57 (Conv2D)           (None, 32, 32, 16)        2320      
_________________________________________________________________
conv2d_58 (Conv2D)           (None, 32, 32, 16)        2320      
_________________________________________________________________
conv2d_59 (Conv2D)           (None, 16, 16, 16)        2320      
_________________________________________________________________
max_pooling2d_24 (MaxPooling (None, 8, 8, 16)          0         
_________________________________________________________________
conv2d_60 (Conv2D)           (None, 8, 8, 32)          4640      
_________________________________________________________________
conv2d_61 (Conv2D)           (None, 8, 8, 32)          9248      
_________________________________________________________________
max_pooling2d_25 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
conv2d_62 (Conv2D)           (None, 4, 4, 64)          18496     
_________________________________________________________________
max_pooling2d_26 (MaxPooling (None, 2, 2, 64)          0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 256)               0         
_________________________________________________________________
dropout_16 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_16 (Dense)             (None, 256)               65792     
_________________________________________________________________
dropout_17 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_17 (Dense)             (None, 4)                 1028      
=================================================================
Total params: 106,612
Trainable params: 106,612
Non-trainable params: 0
_________________________________________________________________
