Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
time_distributed_28 (TimeDis (None, 6, 32, 32, 32)     896       
_________________________________________________________________
time_distributed_29 (TimeDis (None, 6, 16, 16, 32)     9248      
_________________________________________________________________
time_distributed_30 (TimeDis (None, 6, 8, 8, 32)       0         
_________________________________________________________________
time_distributed_31 (TimeDis (None, 6, 2048)           0         
_________________________________________________________________
lstm_7 (LSTM)                (None, 128)               1114624   
_________________________________________________________________
dropout_14 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_14 (Dense)             (None, 256)               33024     
_________________________________________________________________
dropout_15 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_15 (Dense)             (None, 4)                 1028      
=================================================================
Total params: 1,158,820
Trainable params: 1,158,820
Non-trainable params: 0
_________________________________________________________________
