Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
time_distributed_66 (TimeDis (None, 6, 32, 32, 32)     896       
_________________________________________________________________
time_distributed_67 (TimeDis (None, 6, 32, 32, 32)     9248      
_________________________________________________________________
time_distributed_68 (TimeDis (None, 6, 32, 32, 32)     9248      
_________________________________________________________________
time_distributed_69 (TimeDis (None, 6, 16, 16, 32)     9248      
_________________________________________________________________
time_distributed_70 (TimeDis (None, 6, 8, 8, 32)       0         
_________________________________________________________________
time_distributed_71 (TimeDis (None, 6, 8, 8, 64)       18496     
_________________________________________________________________
time_distributed_72 (TimeDis (None, 6, 8, 8, 64)       36928     
_________________________________________________________________
time_distributed_73 (TimeDis (None, 6, 4, 4, 64)       0         
_________________________________________________________________
time_distributed_74 (TimeDis (None, 6, 4, 4, 128)      73856     
_________________________________________________________________
time_distributed_75 (TimeDis (None, 6, 2, 2, 128)      0         
_________________________________________________________________
time_distributed_76 (TimeDis (None, 6, 512)            0         
_________________________________________________________________
lstm_6 (LSTM)                (None, 128)               328192    
_________________________________________________________________
dropout_12 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_12 (Dense)             (None, 256)               33024     
_________________________________________________________________
dropout_13 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_13 (Dense)             (None, 4)                 1028      
=================================================================
Total params: 520,164
Trainable params: 520,164
Non-trainable params: 0
_________________________________________________________________
