Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
time_distributed (TimeDistri (None, 6, 32, 32, 32)     896       
_________________________________________________________________
time_distributed_1 (TimeDist (None, 6, 32, 32, 32)     9248      
_________________________________________________________________
time_distributed_2 (TimeDist (None, 6, 32, 32, 32)     9248      
_________________________________________________________________
time_distributed_3 (TimeDist (None, 6, 16, 16, 32)     9248      
_________________________________________________________________
time_distributed_4 (TimeDist (None, 6, 8, 8, 32)       0         
_________________________________________________________________
time_distributed_5 (TimeDist (None, 6, 8, 8, 64)       18496     
_________________________________________________________________
time_distributed_6 (TimeDist (None, 6, 8, 8, 64)       36928     
_________________________________________________________________
time_distributed_7 (TimeDist (None, 6, 4, 4, 64)       0         
_________________________________________________________________
time_distributed_8 (TimeDist (None, 6, 4, 4, 128)      73856     
_________________________________________________________________
time_distributed_9 (TimeDist (None, 6, 2, 2, 128)      0         
_________________________________________________________________
time_distributed_10 (TimeDis (None, 6, 512)            0         
_________________________________________________________________
lstm (LSTM)                  (None, 128)               328192    
_________________________________________________________________
dropout (Dropout)            (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 256)               33024     
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 4)                 1028      
=================================================================
Total params: 520,164
Trainable params: 520,164
Non-trainable params: 0
_________________________________________________________________
