Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
time_distributed_44 (TimeDis (None, 6, 32, 32, 32)     896       
_________________________________________________________________
time_distributed_45 (TimeDis (None, 6, 32, 32, 32)     9248      
_________________________________________________________________
time_distributed_46 (TimeDis (None, 6, 32, 32, 32)     9248      
_________________________________________________________________
time_distributed_47 (TimeDis (None, 6, 16, 16, 32)     9248      
_________________________________________________________________
time_distributed_48 (TimeDis (None, 6, 8, 8, 32)       0         
_________________________________________________________________
time_distributed_49 (TimeDis (None, 6, 8, 8, 64)       18496     
_________________________________________________________________
time_distributed_50 (TimeDis (None, 6, 8, 8, 64)       36928     
_________________________________________________________________
time_distributed_51 (TimeDis (None, 6, 4, 4, 64)       0         
_________________________________________________________________
time_distributed_52 (TimeDis (None, 6, 4, 4, 128)      73856     
_________________________________________________________________
time_distributed_53 (TimeDis (None, 6, 2, 2, 128)      0         
_________________________________________________________________
time_distributed_54 (TimeDis (None, 6, 512)            0         
_________________________________________________________________
lstm_4 (LSTM)                (None, 128)               328192    
_________________________________________________________________
dropout_8 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 256)               33024     
_________________________________________________________________
dropout_9 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 4)                 1028      
=================================================================
Total params: 520,164
Trainable params: 520,164
Non-trainable params: 0
_________________________________________________________________
