Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
time_distributed_77 (TimeDis (None, 6, 32, 32, 32)     896       
_________________________________________________________________
time_distributed_78 (TimeDis (None, 6, 32, 32, 32)     9248      
_________________________________________________________________
time_distributed_79 (TimeDis (None, 6, 32, 32, 32)     9248      
_________________________________________________________________
time_distributed_80 (TimeDis (None, 6, 16, 16, 32)     9248      
_________________________________________________________________
time_distributed_81 (TimeDis (None, 6, 8, 8, 32)       0         
_________________________________________________________________
time_distributed_82 (TimeDis (None, 6, 8, 8, 64)       18496     
_________________________________________________________________
time_distributed_83 (TimeDis (None, 6, 8, 8, 64)       36928     
_________________________________________________________________
time_distributed_84 (TimeDis (None, 6, 4, 4, 64)       0         
_________________________________________________________________
time_distributed_85 (TimeDis (None, 6, 4, 4, 128)      73856     
_________________________________________________________________
time_distributed_86 (TimeDis (None, 6, 2, 2, 128)      0         
_________________________________________________________________
time_distributed_87 (TimeDis (None, 6, 512)            0         
_________________________________________________________________
lstm_7 (LSTM)                (None, 128)               328192    
_________________________________________________________________
dropout_14 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_14 (Dense)             (None, 256)               33024     
_________________________________________________________________
dropout_15 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_15 (Dense)             (None, 4)                 1028      
=================================================================
Total params: 520,164
Trainable params: 520,164
Non-trainable params: 0
_________________________________________________________________
