Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_42 (Conv2D)           (None, 32, 32, 16)        448       
_________________________________________________________________
conv2d_43 (Conv2D)           (None, 32, 32, 16)        2320      
_________________________________________________________________
conv2d_44 (Conv2D)           (None, 32, 32, 16)        2320      
_________________________________________________________________
conv2d_45 (Conv2D)           (None, 16, 16, 16)        2320      
_________________________________________________________________
max_pooling2d_18 (MaxPooling (None, 8, 8, 16)          0         
_________________________________________________________________
conv2d_46 (Conv2D)           (None, 8, 8, 32)          4640      
_________________________________________________________________
conv2d_47 (Conv2D)           (None, 8, 8, 32)          9248      
_________________________________________________________________
max_pooling2d_19 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
conv2d_48 (Conv2D)           (None, 4, 4, 64)          18496     
_________________________________________________________________
max_pooling2d_20 (MaxPooling (None, 2, 2, 64)          0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 256)               0         
_________________________________________________________________
dropout_12 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_12 (Dense)             (None, 256)               65792     
_________________________________________________________________
dropout_13 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_13 (Dense)             (None, 4)                 1028      
=================================================================
Total params: 106,612
Trainable params: 106,612
Non-trainable params: 0
_________________________________________________________________
