Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_16 (Conv2D)           (None, 32, 32, 16)        448       
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 16, 16, 16)        2320      
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 8, 8, 16)          0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 1024)              0         
_________________________________________________________________
dropout_16 (Dropout)         (None, 1024)              0         
_________________________________________________________________
dense_16 (Dense)             (None, 256)               262400    
_________________________________________________________________
dropout_17 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_17 (Dense)             (None, 4)                 1028      
=================================================================
Total params: 266,196
Trainable params: 266,196
Non-trainable params: 0
_________________________________________________________________
