Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
time_distributed_88 (TimeDis (None, 6, 32, 32, 32)     896       
_________________________________________________________________
time_distributed_89 (TimeDis (None, 6, 32, 32, 32)     9248      
_________________________________________________________________
time_distributed_90 (TimeDis (None, 6, 32, 32, 32)     9248      
_________________________________________________________________
time_distributed_91 (TimeDis (None, 6, 16, 16, 32)     9248      
_________________________________________________________________
time_distributed_92 (TimeDis (None, 6, 8, 8, 32)       0         
_________________________________________________________________
time_distributed_93 (TimeDis (None, 6, 8, 8, 64)       18496     
_________________________________________________________________
time_distributed_94 (TimeDis (None, 6, 8, 8, 64)       36928     
_________________________________________________________________
time_distributed_95 (TimeDis (None, 6, 4, 4, 64)       0         
_________________________________________________________________
time_distributed_96 (TimeDis (None, 6, 4, 4, 128)      73856     
_________________________________________________________________
time_distributed_97 (TimeDis (None, 6, 2, 2, 128)      0         
_________________________________________________________________
time_distributed_98 (TimeDis (None, 6, 512)            0         
_________________________________________________________________
lstm_8 (LSTM)                (None, 128)               328192    
_________________________________________________________________
dropout_16 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_16 (Dense)             (None, 256)               33024     
_________________________________________________________________
dropout_17 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_17 (Dense)             (None, 4)                 1028      
=================================================================
Total params: 520,164
Trainable params: 520,164
Non-trainable params: 0
_________________________________________________________________
