Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
time_distributed (TimeDistri (None, 6, 32, 32, 32)     896       
_________________________________________________________________
time_distributed_1 (TimeDist (None, 6, 16, 16, 32)     9248      
_________________________________________________________________
time_distributed_2 (TimeDist (None, 6, 8, 8, 32)       0         
_________________________________________________________________
time_distributed_3 (TimeDist (None, 6, 2048)           0         
_________________________________________________________________
lstm (LSTM)                  (None, 128)               1114624   
_________________________________________________________________
dropout (Dropout)            (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 256)               33024     
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 4)                 1028      
=================================================================
Total params: 1,158,820
Trainable params: 1,158,820
Non-trainable params: 0
_________________________________________________________________
