Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_49 (Conv2D)           (None, 32, 32, 16)        448       
_________________________________________________________________
conv2d_50 (Conv2D)           (None, 32, 32, 16)        2320      
_________________________________________________________________
conv2d_51 (Conv2D)           (None, 32, 32, 16)        2320      
_________________________________________________________________
conv2d_52 (Conv2D)           (None, 32, 32, 16)        2320      
_________________________________________________________________
max_pooling2d_21 (MaxPooling (None, 16, 16, 16)        0         
_________________________________________________________________
conv2d_53 (Conv2D)           (None, 16, 16, 32)        4640      
_________________________________________________________________
conv2d_54 (Conv2D)           (None, 16, 16, 32)        9248      
_________________________________________________________________
max_pooling2d_22 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_55 (Conv2D)           (None, 8, 8, 64)          18496     
_________________________________________________________________
max_pooling2d_23 (MaxPooling (None, 4, 4, 64)          0         
_________________________________________________________________
flatten_7 (Flatten)          (None, 1024)              0         
_________________________________________________________________
dropout_14 (Dropout)         (None, 1024)              0         
_________________________________________________________________
dense_14 (Dense)             (None, 256)               262400    
_________________________________________________________________
dropout_15 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_15 (Dense)             (None, 4)                 1028      
=================================================================
Total params: 303,220
Trainable params: 303,220
Non-trainable params: 0
_________________________________________________________________
