Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
time_distributed_11 (TimeDis (None, 6, 32, 32, 32)     896       
_________________________________________________________________
time_distributed_12 (TimeDis (None, 6, 32, 32, 32)     9248      
_________________________________________________________________
time_distributed_13 (TimeDis (None, 6, 32, 32, 32)     9248      
_________________________________________________________________
time_distributed_14 (TimeDis (None, 6, 16, 16, 32)     9248      
_________________________________________________________________
time_distributed_15 (TimeDis (None, 6, 8, 8, 32)       0         
_________________________________________________________________
time_distributed_16 (TimeDis (None, 6, 8, 8, 64)       18496     
_________________________________________________________________
time_distributed_17 (TimeDis (None, 6, 8, 8, 64)       36928     
_________________________________________________________________
time_distributed_18 (TimeDis (None, 6, 4, 4, 64)       0         
_________________________________________________________________
time_distributed_19 (TimeDis (None, 6, 4, 4, 128)      73856     
_________________________________________________________________
time_distributed_20 (TimeDis (None, 6, 2, 2, 128)      0         
_________________________________________________________________
time_distributed_21 (TimeDis (None, 6, 512)            0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 128)               328192    
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 256)               33024     
_________________________________________________________________
dropout_3 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 4)                 1028      
=================================================================
Total params: 520,164
Trainable params: 520,164
Non-trainable params: 0
_________________________________________________________________
