Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
time_distributed_55 (TimeDis (None, 6, 32, 32, 32)     896       
_________________________________________________________________
time_distributed_56 (TimeDis (None, 6, 32, 32, 32)     9248      
_________________________________________________________________
time_distributed_57 (TimeDis (None, 6, 32, 32, 32)     9248      
_________________________________________________________________
time_distributed_58 (TimeDis (None, 6, 16, 16, 32)     9248      
_________________________________________________________________
time_distributed_59 (TimeDis (None, 6, 8, 8, 32)       0         
_________________________________________________________________
time_distributed_60 (TimeDis (None, 6, 8, 8, 64)       18496     
_________________________________________________________________
time_distributed_61 (TimeDis (None, 6, 8, 8, 64)       36928     
_________________________________________________________________
time_distributed_62 (TimeDis (None, 6, 4, 4, 64)       0         
_________________________________________________________________
time_distributed_63 (TimeDis (None, 6, 4, 4, 128)      73856     
_________________________________________________________________
time_distributed_64 (TimeDis (None, 6, 2, 2, 128)      0         
_________________________________________________________________
time_distributed_65 (TimeDis (None, 6, 512)            0         
_________________________________________________________________
lstm_5 (LSTM)                (None, 128)               328192    
_________________________________________________________________
dropout_10 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 256)               33024     
_________________________________________________________________
dropout_11 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 4)                 1028      
=================================================================
Total params: 520,164
Trainable params: 520,164
Non-trainable params: 0
_________________________________________________________________
