Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
time_distributed_16 (TimeDis (None, 6, 32, 32, 32)     896       
_________________________________________________________________
time_distributed_17 (TimeDis (None, 6, 16, 16, 32)     9248      
_________________________________________________________________
time_distributed_18 (TimeDis (None, 6, 8, 8, 32)       0         
_________________________________________________________________
time_distributed_19 (TimeDis (None, 6, 2048)           0         
_________________________________________________________________
lstm_4 (LSTM)                (None, 128)               1114624   
_________________________________________________________________
dropout_8 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 256)               33024     
_________________________________________________________________
dropout_9 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 4)                 1028      
=================================================================
Total params: 1,158,820
Trainable params: 1,158,820
Non-trainable params: 0
_________________________________________________________________
