Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_25 (Conv2D)           (None, 32, 32, 16)        448       
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 16, 16, 16)        2320      
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 8, 8, 16)          0         
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 8, 8, 32)          4640      
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 8, 8, 32)          9248      
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 4, 4, 32)          0         
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 4, 4, 64)          18496     
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 2, 2, 64)          0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 256)               0         
_________________________________________________________________
dropout_10 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 256)               65792     
_________________________________________________________________
dropout_11 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 4)                 1028      
=================================================================
Total params: 101,972
Trainable params: 101,972
Non-trainable params: 0
_________________________________________________________________
